# Taps for typical homebrew setup
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Basic terminal tools
# brew "fish"
brew "curl"
brew "wget"
brew "bat"
brew "gum"
brew "fd"
brew "fzf"
brew "openldap"
brew "tmux"

# Plugins and CLIs
brew "antidote"
brew "gh"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Basic apps
cask "rectangle"
cask "visual-studio-code"
cask "docker"

# 1up-specific reqs
brew "gimme-aws-creds"
tap "snyk/tap"
brew "snyk/tap/snyk"
cask "pgadmin4"
cask "slack"
