# Taps for typical homebrew setup
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Basic terminal tools
brew "fish"
brew "curl"
brew "wget"
brew "bat"
brew "gum"
brew "fd"
brew "fzf"
brew "openldap"
brew "pcre2"
brew "gnu-sed"
brew "neovim"
brew "ripgrep"

# Plugins and CLIs
brew "gh"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Basic apps
cask "rectangle"
cask "vscodium"
cask "firefox"
cask "docker"
cask "pgadmin4"
# cask "obsidian"

# 1up-specific reqs
brew "gimme-aws-creds"
tap "snyk/tap"
brew "snyk/tap/snyk"
cask "openvpn-connect"

