# Taps for typical homebrew setup
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "martido/homebrew-graph"

# Basic terminal tools
brew "fish"
brew "curl"
brew "wget"
brew "bat"
brew "gum"
brew "fd"
brew "fzf"
brew "openldap"
brew "tmux"
brew "python@3.10"
brew "pcre2"
brew "gnu-sed"
brew "neovim"

# Plugins and CLIs
brew "antidote"
brew "gh"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Basic apps
cask "rectangle"
cask "visual-studio-code"
cask "docker"
cask "obsidian"

# 1up-specific reqs
brew "gimme-aws-creds"
tap "snyk/tap"
brew "snyk/tap/snyk"
tap "authzed/tap"
brew "authzed/tap/zed"
cask "pgadmin4"
cask "slack"
cask "openvpn-connect"
brew "tfenv"
brew "kubectl"
brew "awscli"
brew "openjdk@17"
brew "gradle"

